import os


class topo:
    def __init__(self) -> None:
        # 邻接矩阵
        self.tp = {
            1: {2, 3},
            2: {1, 3},
            3: {1, 2, 4},
            4: {3, 5},
            5: {4, 6, 7},
            6: {5, 7, 12},
            7: {5, 6, 8},
            8: {7, 9},
            9: {8},
            10: {11, 12},
            11: {10, 12},
            12: {6, 10, 11},
        }
        self.host = [1, 2, 6, 7, 8, 9, 10, 11]    # 主机的节点
        self.rt_num = 12 # 路由器个数
        # 运行RIP的路由器
        self.rip_list = [1,2,3,4,6,7,8,9,10,11,12]
        # 运行ospf的路由器
        self.ospf_list = [4,5,6,7]
        # 路由重分发的路由器
        self.re_rt_list = [4,6,7]